; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-5-4)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	plane5 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	city8 - city
	)
(:init
	(at plane1 city2)
	(= (capacity plane1) 5228)
	(= (fuel plane1) 1123)
	(= (slow-burn plane1) 2)
	(= (fast-burn plane1) 6)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 2)
	(at plane2 city0)
	(= (capacity plane2) 4247)
	(= (fuel plane2) 1342)
	(= (slow-burn plane2) 2)
	(= (fast-burn plane2) 4)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 7)
	(at plane3 city5)
	(= (capacity plane3) 8712)
	(= (fuel plane3) 152)
	(= (slow-burn plane3) 3)
	(= (fast-burn plane3) 8)
	(= (onboard plane3) 0)
	(= (zoom-limit plane3) 6)
	(at plane4 city3)
	(= (capacity plane4) 2838)
	(= (fuel plane4) 478)
	(= (slow-burn plane4) 1)
	(= (fast-burn plane4) 3)
	(= (onboard plane4) 0)
	(= (zoom-limit plane4) 2)
	(at plane5 city1)
	(= (capacity plane5) 14645)
	(= (fuel plane5) 1334)
	(= (slow-burn plane5) 5)
	(= (fast-burn plane5) 19)
	(= (onboard plane5) 0)
	(= (zoom-limit plane5) 3)
	(at person1 city2)
	(at person2 city0)
	(at person3 city1)
	(at person4 city4)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 543)
	(= (distance city0 city2) 949)
	(= (distance city0 city3) 623)
	(= (distance city0 city4) 833)
	(= (distance city0 city5) 949)
	(= (distance city0 city6) 640)
	(= (distance city0 city7) 822)
	(= (distance city0 city8) 529)
	(= (distance city1 city0) 543)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 904)
	(= (distance city1 city3) 754)
	(= (distance city1 city4) 601)
	(= (distance city1 city5) 929)
	(= (distance city1 city6) 552)
	(= (distance city1 city7) 856)
	(= (distance city1 city8) 633)
	(= (distance city2 city0) 949)
	(= (distance city2 city1) 904)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 749)
	(= (distance city2 city4) 911)
	(= (distance city2 city5) 652)
	(= (distance city2 city6) 550)
	(= (distance city2 city7) 671)
	(= (distance city2 city8) 595)
	(= (distance city3 city0) 623)
	(= (distance city3 city1) 754)
	(= (distance city3 city2) 749)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 878)
	(= (distance city3 city5) 659)
	(= (distance city3 city6) 676)
	(= (distance city3 city7) 729)
	(= (distance city3 city8) 972)
	(= (distance city4 city0) 833)
	(= (distance city4 city1) 601)
	(= (distance city4 city2) 911)
	(= (distance city4 city3) 878)
	(= (distance city4 city4) 0)
	(= (distance city4 city5) 985)
	(= (distance city4 city6) 565)
	(= (distance city4 city7) 826)
	(= (distance city4 city8) 727)
	(= (distance city5 city0) 949)
	(= (distance city5 city1) 929)
	(= (distance city5 city2) 652)
	(= (distance city5 city3) 659)
	(= (distance city5 city4) 985)
	(= (distance city5 city5) 0)
	(= (distance city5 city6) 855)
	(= (distance city5 city7) 870)
	(= (distance city5 city8) 677)
	(= (distance city6 city0) 640)
	(= (distance city6 city1) 552)
	(= (distance city6 city2) 550)
	(= (distance city6 city3) 676)
	(= (distance city6 city4) 565)
	(= (distance city6 city5) 855)
	(= (distance city6 city6) 0)
	(= (distance city6 city7) 979)
	(= (distance city6 city8) 703)
	(= (distance city7 city0) 822)
	(= (distance city7 city1) 856)
	(= (distance city7 city2) 671)
	(= (distance city7 city3) 729)
	(= (distance city7 city4) 826)
	(= (distance city7 city5) 870)
	(= (distance city7 city6) 979)
	(= (distance city7 city7) 0)
	(= (distance city7 city8) 626)
	(= (distance city8 city0) 529)
	(= (distance city8 city1) 633)
	(= (distance city8 city2) 595)
	(= (distance city8 city3) 972)
	(= (distance city8 city4) 727)
	(= (distance city8 city5) 677)
	(= (distance city8 city6) 703)
	(= (distance city8 city7) 626)
	(= (distance city8 city8) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at plane2 city4)
	(at person1 city5)
	(at person2 city8)
	(at person3 city3)
	(at person4 city8)
	))

(:metric minimize (+ (* 3 (total-time))  (* 2 (total-fuel-used))))
)

; plan
1. (refuel plane2 city0)
   changed: (fuel plane2) from 1342 to 4247
   goals met: 0 of 5
2. (board person2 plane2 city0)
   deleted: (at person2 city0)
   added: (in person2 plane2)
   changed: (onboard plane2) from 0 to 1
   goals met: 0 of 5
3. (fly plane2 city0 city2)
   deleted: (at plane2 city0)
   added: (at plane2 city2)
   changed: (total-fuel-used) from 0 to 1898, (fuel plane2) from 4247 to 2349
   goals met: 0 of 5
4. (board person1 plane2 city2)
   deleted: (at person1 city2)
   added: (in person1 plane2)
   changed: (onboard plane2) from 1 to 2
   goals met: 0 of 5
5. (board person3 plane5 city1)
   deleted: (at person3 city1)
   added: (in person3 plane5)
   changed: (onboard plane5) from 0 to 1
   goals met: 0 of 5
6. (fly plane2 city2 city4)
   deleted: (at plane2 city2)
   added: (at plane2 city4)
   changed: (total-fuel-used) from 1898 to 3720, (fuel plane2) from 2349 to 527
   goals met: 1 of 5
7. (board person4 plane2 city4)
   deleted: (at person4 city4)
   added: (in person4 plane2)
   changed: (onboard plane2) from 2 to 3
   goals met: 1 of 5
8. (refuel plane5 city1)
   changed: (fuel plane5) from 1334 to 14645
   goals met: 1 of 5
9. (fly plane5 city1 city3)
   deleted: (at plane5 city1)
   added: (at plane5 city3)
   changed: (total-fuel-used) from 3720 to 7490, (fuel plane5) from 14645 to 10875
   goals met: 1 of 5
10. (debark person3 plane5 city3)
   deleted: (in person3 plane5)
   added: (at person3 city3)
   changed: (onboard plane5) from 1 to 0
   goals met: 2 of 5
11. (refuel plane2 city4)
   changed: (fuel plane2) from 527 to 4247
   goals met: 2 of 5
12. (fly plane2 city4 city5)
   deleted: (at plane2 city4)
   added: (at plane2 city5)
   changed: (total-fuel-used) from 7490 to 9460, (fuel plane2) from 4247 to 2277
   goals met: 1 of 5
13. (debark person1 plane2 city5)
   deleted: (in person1 plane2)
   added: (at person1 city5)
   changed: (onboard plane2) from 3 to 2
   goals met: 2 of 5
14. (fly plane2 city5 city4)
   deleted: (at plane2 city5)
   added: (at plane2 city4)
   changed: (total-fuel-used) from 9460 to 11430, (fuel plane2) from 2277 to 307
   goals met: 3 of 5
15. (refuel plane2 city4)
   changed: (fuel plane2) from 307 to 4247
   goals met: 3 of 5
16. (fly plane2 city4 city8)
   deleted: (at plane2 city4)
   added: (at plane2 city8)
   changed: (total-fuel-used) from 11430 to 12884, (fuel plane2) from 4247 to 2793
   goals met: 2 of 5
17. (debark person2 plane2 city8)
   deleted: (in person2 plane2)
   added: (at person2 city8)
   changed: (onboard plane2) from 2 to 1
   goals met: 3 of 5
18. (debark person4 plane2 city8)
   deleted: (in person4 plane2)
   added: (at person4 city8)
   changed: (onboard plane2) from 1 to 0
   goals met: 4 of 5
19. (fly plane2 city8 city4)
   deleted: (at plane2 city8)
   added: (at plane2 city4)
   changed: (total-fuel-used) from 12884 to 14338, (fuel plane2) from 2793 to 1339
   goals met: 5 of 5
